<a href="https://colab.research.google.com/github/royarkaofficial/DataOps-Lab-Explore-SQL-8th-Jan/blob/main/Copy_of_Lab_Explore_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Problem statment :
Title : Demonstrating Python SQLite3 Integration for Database operations

Objective :
Design an implement a python program that will establishing a connection to SQLlite DB.
a. Create the table
b. Performs various SQL operations (INSERT , UPDATE , DELETE , ALTER , DROP)
c. Display the results of each operation

This program aims to serve lab exercise for students learning DB operations and its integration with Python

Problem Description :
Develop a python program that simulate basic STUDENT DB system for lab demo.
The program must include ðŸ‡°

Step 1 :Establish a connection with SQLite 3

Step 2: Create a table named STUDENTS with following fields
  id = Unique identifier (Primary key)
  name = Student's name (Text , No null)
  age = Student's age (Integer)
  grade = Students's grade (Text)
Step 3:
1. Insert sample student data into table using the INSERT Command
2. Query the table using the SELECT command to retrieve and display
3. Update a student's grade using the UPDATE command
4. Delete a student's record based on thier name using DELETE command
5. Alter the table to add a new column (Email) using ALTER table command
6. Drop the table using the DROP command
7. Close the DB connections

In [1]:
import sqlite3

In [2]:
#Connect and to create a DB
connection = sqlite3.connect('student.db')

In [3]:
cursor = connection.cursor()

In [4]:
#create a table
q1 = """
CREATE TABLE IF NOT EXISTS students (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    age INTEGER,
    grade TEXT
);
"""
cursor.execute(q1)
print("Students tabel created")

Students tabel created

In [5]:
#Insert the values to the tabel
data = [
    [101 , "Sahoo" , 16 , "C"],
    [102 , "Mounika" , 16 , "B"],
    [103 , "Babu" , 16 , "A"],
    [104 , "Cheery" , 16 , "B+"],
]
q2 = "INSERT INTO students (id , name , age , grade) VALUES (?,?,?,?)"
cursor.executemany(q2 , data)
print("Data inserted")
connection.commit()

Data inserted

In [6]:
# Fetch and print the data
q3 = "SELECT * FROM students"
cursor.execute(q3)

# Fetch all rows from the executed query
rows = cursor.fetchall()

# Print the data in a tabular format
print("ID\tName\t\tAge\tGrade")
print("-" * 40)
for row in rows:
    print(f"{row[0]}\t{row[1]}\t\t{row[2]}\t{row[3]}")

# Commit the transaction (if not already committed)
connection.commit()

ID	Name		Age	Grade
----------------------------------------
101	Sahoo		16	C
102	Mounika		16	B
103	Babu		16	A
104	Cheery		16	B+

In [7]:
#Insert the values to the tabel
data = [
    [104 , "Cheery" , 16 , "B+"],
]
q2 = "INSERT INTO students (id , name , age , grade) VALUES (?,?,?,?)"
cursor.executemany(q2 , data)

print("Data inserted")
connection.commit()

IntegrityError: UNIQUE constraint failed: students.id

In [8]:
data = [
    [104, "Cheery", 16, "B+"],
]

for row in data:
    q_check = "SELECT COUNT(*) FROM students WHERE id = ?"
    cursor.execute(q_check, (row[0],))
    if cursor.fetchone()[0] == 0:  # If ID does not exist
        q2 = "INSERT INTO students (id, name, age, grade) VALUES (?, ?, ?, ?)"
        cursor.execute(q2, row)
        print(f"Data inserted for ID {row[0]}")
    else:
        print(f"ID {row[0]} already exists. Skipping insertion.")
connection.commit()

ID 104 already exists. Skipping insertion.

In [9]:
data = [
    [104, "Cheery", 16, "B+"],
]

q2 = "INSERT OR REPLACE INTO students (id, name, age, grade) VALUES (?, ?, ?, ?)"
cursor.executemany(q2, data)

print("Data inserted or replaced")
connection.commit()

Data inserted or replaced

In [10]:
#Display all the data in the table
q3 = "SELECT * FROM students"
cursor.execute(q3)
rows = cursor.fetchall()
for row in rows:
    print(row)

(101, 'Sahoo', 16, 'C')
(102, 'Mounika', 16, 'B')
(103, 'Babu', 16, 'A')
(104, 'Cheery', 16, 'B+')

In [11]:
#Update a student's grade using UPDATE command
q4 = "UPDATE students SET grade = 'A' WHERE id = 101"
cursor.execute(q4)
connection.commit()
print("Grade updated")

Grade updated

In [12]:
#Display all the data in the table
q3 = "SELECT * FROM students"
cursor.execute(q3)
rows = cursor.fetchall()
for row in rows:
    print(row)

(101, 'Sahoo', 16, 'A')
(102, 'Mounika', 16, 'B')
(103, 'Babu', 16, 'A')
(104, 'Cheery', 16, 'B+')

In [13]:
#Delete a student's record based on thier name
q5 = "DELETE FROM students WHERE name = 'Cheery' "
cursor.execute(q5)
connection.commit()
print("Data is deleted")

Data is deleted

In [14]:
#Display all the data in the table
q3 = "SELECT * FROM students"
cursor.execute(q3)
rows = cursor.fetchall()
for row in rows:
    print(row)

(101, 'Sahoo', 16, 'A')
(102, 'Mounika', 16, 'B')
(103, 'Babu', 16, 'A')

In [15]:
#Alter the table to add a new column "Email" using the ALTER command

q6 = "ALTER TABLE students ADD COLUMN email TEXT"
cursor.execute(q6)
connection.commit()
print("Email column added")

Email column added

In [16]:
#Display all the data in the table
q3 = "SELECT * FROM students"
cursor.execute(q3)
rows = cursor.fetchall()
for row in rows:
    print(row)

(101, 'Sahoo', 16, 'A', None)
(102, 'Mounika', 16, 'B', None)
(103, 'Babu', 16, 'A', None)

In [17]:
cursor.execute("UPDATE students SET email = 'sahoo@gmail.com' WHERE id = 101")
cursor.execute("UPDATE students SET email = 'mounika@gmail.com' WHERE id = 102")
cursor.execute("UPDATE students SET email = 'babu@gmail.com' WHERE id = 103")

In [18]:
#Display all the data in the table
q3 = "SELECT * FROM students"
cursor.execute(q3)
rows = cursor.fetchall()
for row in rows:
    print(row)

(101, 'Sahoo', 16, 'A', 'sahoo@gmail.com')
(102, 'Mounika', 16, 'B', 'mounika@gmail.com')
(103, 'Babu', 16, 'A', 'babu@gmail.com')

In [19]:
q7 = "DROP TABLE students"
cursor.execute(q7)
connection.commit()
print("Table dropped")

Table dropped

In [20]:
#Display all the data in the table
q3 = "SELECT * FROM students"
cursor.execute(q3)
rows = cursor.fetchall()
for row in rows:
    print(row)

OperationalError: no such table: students

In [21]:
#close the connection
connection.close()

Checking the metadata of the DB

In [22]:
#create and connect to DB
connection = sqlite3.connect('student.db')

cursor = connection.cursor()

#create a table
#create a table
q1 = """
CREATE TABLE IF NOT EXISTS students (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    age INTEGER,
    grade TEXT
);
"""
cursor.execute(q1)
print("Students tabel created")

#Insert the values to the tabel
data = [
    [101 , "Sahoo" , 16 , "C"],
    [102 , "Mounika" , 16 , "B"],
    [103 , "Babu" , 16 , "A"],
    [104 , "Cheery" , 16 , "B+"],
]
q2 = "INSERT INTO students (id , name , age , grade) VALUES (?,?,?,?)"
cursor.executemany(q2 , data)

print("Data inserted")
connection.commit()

Students tabel created
Data inserted

In [23]:
#Display all the data in the table
q3 = "SELECT * FROM students"
cursor.execute(q3)
rows = cursor.fetchall()
for row in rows:
    print(row)

(101, 'Sahoo', 16, 'C')
(102, 'Mounika', 16, 'B')
(103, 'Babu', 16, 'A')
(104, 'Cheery', 16, 'B+')

In [24]:
q8 = "SELECT name FROM sqlite_master WHERE type = 'table'"
cursor.execute(q8)
tables = cursor.fetchall()
for table in tables:
    print(table[0])

students

In [25]:
#Extract information about the students table
q9 = "PRAGMA table_info(students)" #Retrieving the metadata
cursor.execute(q9)
data = cursor.fetchall()
for row in data:
    print(row)

#ColumnID , Column name , Data type , NotNULL , Default_Values , Primary key

(0, 'id', 'INTEGER', 0, None, 1)
(1, 'name', 'TEXT', 1, None, 0)
(2, 'age', 'INTEGER', 0, None, 0)
(3, 'grade', 'TEXT', 0, None, 0)

Join the table
Combine the data from multiples tables based on related between them
a. INNER JOIN
b. LEFT JOIN
c. RIGHT JOIN
d. FULL JOIN

In [28]:
#Create a table 2
cursor.execute("DROP TABLE IF EXISTS courses;") # Added drop table to ensure the table is recreated each time
cursor.execute('''
CREATE TABLE IF NOT EXISTS courses (
    id INTEGER PRIMARY KEY,
    subject TEXT,
    marks INTEGER
)
''')

print("Courses tabel created")

#Insert the values to the tabel
cursor.executemany('''
    INSERT INTO courses (id , subject , marks) VALUES (?,?,?)
    ''',[
         [101 , "Science" , 25],
         [102 , "Maths" , 56],
         [103 , "Social" , 98 ],
         [104 , "English" , 54]
    ])

Courses tabel created

In [29]:
#Perform the join operation
cursor.execute('''
    SELECT students.id , students.name , students.age, students.grade, courses.subject , courses.marks
    FROM students
    JOIN courses ON students.id = courses.id
''')

#Fetch and print all the results
joined_data = cursor.fetchall()
print("Joined Table")
for row in joined_data:
  print(row)

#close the connectiosn
connection.commit()
connection.close()

Joined Table
(101, 'Sahoo', 16, 'C', 'Science', 25)
(102, 'Mounika', 16, 'B', 'Maths', 56)
(103, 'Babu', 16, 'A', 'Social', 98)
(104, 'Cheery', 16, 'B+', 'English', 54)